src/Catalogs/СообщенияЧата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>СообщенияЧата</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ОбменHTTP/Ext/Module.bsl
Функция ОбработкаЗапроса(Запрос, ЭтоPOST) Экспорт
	
	Перем Ответ, Причина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(Запрос, ЭтоPOST);
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("ИмяМетода");
	
	Если ИмяМетода = "СоздатьСообщение" Тогда
		КодОтвета = 200;
		СоздатьСообщение(ПараметрыЗапроса);	
	Иначе
		КодОтвета = 400;
		Причина = "Не найдено имя метода";
	КонецЕсли;
	
	#Если НЕ МобильноеПриложениеСервер Тогда
		Ответ = Новый HTTPСервисОтвет(КодОтвета);
		Ответ.Причина = Причина;
	#КонецЕсли	
		
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьПараметрыЗапроса(Знач Запрос, Знач ЭтоPOST)
	
	Перем МассивПараметров, Параметр, ПараметрыЗапроса;
	
	ПараметрыЗапроса = Новый Структура;
	
	Если ЭтоPOST тогда		
		ПараметрыЗапроса = РаскодироватьСтроку(СтрЗаменить(Запрос.ПолучитьТелоКакСтроку(),"+"," "),СпособКодированияСтроки.КодировкаURL);
		МассивПараметров = СтрРазделить(ПараметрыЗапроса, "&", Истина);
		ПараметрыЗапроса = МассивПараметровHTTPЗапросаВСтруктуру(МассивПараметров);
	Иначе
		Для каждого Параметр из Запрос.ПараметрыЗапроса цикл
			ПараметрыЗапроса.Вставить(Параметр.Ключ,Параметр.Значение);	
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыЗапроса;

КонецФункции

Функция МассивПараметровHTTPЗапросаВСтруктуру(МассивПараметров) Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	
	Для каждого ПараметрЭлемент из МассивПараметров цикл	
		
		Если Не ЗначениеЗаполнено(ПараметрЭлемент) тогда
			Продолжить;
		КонецЕсли;
		
		НомерСимволаРазделителя = СтрНайти(ПараметрЭлемент, "=");
		ПараметрИмя = Лев(ПараметрЭлемент, НомерСимволаРазделителя - 1);
		Значение = Сред(ПараметрЭлемент, НомерСимволаРазделителя + 1);
		ПараметрыЗапроса.Вставить(ПараметрИмя, Значение);		
		
	КонецЦикла;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Процедура СоздатьСообщение(ПараметрыЗапроса)

	Ссылка = ПолучитьСсылкуПоУИД("СообщенияЧата", ПараметрыЗапроса.Ссылка);

	Если НЕ ЗначениеЗаполнено(Ссылка.ВерсияДанных) Тогда
	
		СправочникОбъект = Справочники.СообщенияЧата.СоздатьЭлемент();
		СправочникОбъект.УстановитьСсылкуНового(Ссылка);
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, ПараметрыЗапроса);
		
		СправочникОбъект.Автор = ПолучитьСсылкуПоУИД("Сотрудники", ПараметрыЗапроса.Автор);
		
		СправочникОбъект.ТранспортноеСредство = 
			ПолучитьСсылкуПоУИД("ТранспортныеСредства", ПараметрыЗапроса.ТранспортноеСредство);
			
		СправочникОбъект.КаналЧата = Перечисления.РолиСотрудников[ПараметрыЗапроса.КаналЧата];
		СправочникОбъект.Наименование = ПараметрыЗапроса.ТекстСообщения;
			
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Записать();
			
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСсылкуПоУИД(ИмяСправочника, Ссылка)
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(Ссылка);
	Возврат Справочники[ИмяСправочника].ПолучитьСсылку(УникальныйИдентификатор);
	
КонецФункции
